sys_bench/fio/2nd/4k.read.fio.output
job1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job2: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job3: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job4: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job5: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job6: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job7: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job8: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
fio-3.1
Starting 8 processes

job1: (groupid=0, jobs=1): err= 0: pid=74257: Thu Feb  7 08:06:37 2019
   read: IOPS=25.9k, BW=101MiB/s (106MB/s)(6077MiB/60006msec)
    slat (usec): min=2, max=7707, avg=36.61, stdev=183.89
    clat (usec): min=953, max=83467, avg=7676.31, stdev=3178.14
     lat (usec): min=957, max=83479, avg=7712.99, stdev=3183.71
    clat percentiles (usec):
     |  1.00th=[ 3458],  5.00th=[ 3720], 10.00th=[ 3982], 20.00th=[ 4948],
     | 30.00th=[ 5997], 40.00th=[ 6390], 50.00th=[ 7439], 60.00th=[ 8455],
     | 70.00th=[ 8848], 80.00th=[ 9896], 90.00th=[10945], 95.00th=[11338],
     | 99.00th=[19006], 99.50th=[23462], 99.90th=[34341], 99.95th=[39060],
     | 99.99th=[47973]
   bw (  KiB/s): min=91560, max=128424, per=12.62%, avg=104046.59, stdev=4558.56, samples=120
   iops        : min=22890, max=32106, avg=26011.43, stdev=1139.59, samples=120
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.04%, 4=10.14%, 10=72.90%, 20=16.08%, 50=0.84%
  lat (msec)   : 100=0.01%
  cpu          : usr=4.02%, sys=12.51%, ctx=51396, majf=0, minf=465
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=1555783,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=200
job2: (groupid=0, jobs=1): err= 0: pid=74258: Thu Feb  7 08:06:37 2019
   read: IOPS=25.9k, BW=101MiB/s (106MB/s)(6068MiB/60006msec)
    slat (usec): min=2, max=9654, avg=36.69, stdev=185.63
    clat (usec): min=792, max=90232, avg=7687.40, stdev=3438.50
     lat (usec): min=795, max=90235, avg=7724.16, stdev=3444.42
    clat percentiles (usec):
     |  1.00th=[ 3228],  5.00th=[ 3589], 10.00th=[ 4015], 20.00th=[ 4817],
     | 30.00th=[ 5800], 40.00th=[ 6521], 50.00th=[ 7242], 60.00th=[ 8160],
     | 70.00th=[ 8979], 80.00th=[ 9765], 90.00th=[10945], 95.00th=[12649],
     | 99.00th=[20055], 99.50th=[23987], 99.90th=[35390], 99.95th=[39584],
     | 99.99th=[51119]
   bw (  KiB/s): min=78760, max=129539, per=12.60%, avg=103886.83, stdev=8336.08, samples=120
   iops        : min=19690, max=32384, avg=25971.46, stdev=2083.95, samples=120
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.05%, 4=9.88%, 10=72.08%, 20=16.98%, 50=1.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=4.01%, sys=12.50%, ctx=50650, majf=0, minf=223
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=1553527,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=200
job3: (groupid=0, jobs=1): err= 0: pid=74259: Thu Feb  7 08:06:37 2019
   read: IOPS=25.0k, BW=101MiB/s (106MB/s)(6084MiB/60005msec)
    slat (usec): min=2, max=5489, avg=36.59, stdev=184.33
    clat (usec): min=603, max=79625, avg=7667.51, stdev=3663.06
     lat (usec): min=607, max=79628, avg=7704.17, stdev=3668.22
    clat percentiles (usec):
     |  1.00th=[ 2737],  5.00th=[ 3556], 10.00th=[ 3785], 20.00th=[ 4752],
     | 30.00th=[ 5735], 40.00th=[ 6325], 50.00th=[ 7177], 60.00th=[ 8160],
     | 70.00th=[ 8848], 80.00th=[ 9634], 90.00th=[10814], 95.00th=[13173],
     | 99.00th=[21890], 99.50th=[25035], 99.90th=[35390], 99.95th=[39584],
     | 99.99th=[49546]
   bw (  KiB/s): min=91472, max=122925, per=12.64%, avg=104160.25, stdev=5931.13, samples=120
   iops        : min=22868, max=30731, avg=26039.83, stdev=1482.75, samples=120
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.05%, 4=11.90%, 10=71.13%, 20=15.42%, 50=1.49%
  lat (msec)   : 100=0.01%
  cpu          : usr=4.02%, sys=12.48%, ctx=50772, majf=0, minf=223
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=1557562,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=200
job4: (groupid=0, jobs=1): err= 0: pid=74260: Thu Feb  7 08:06:37 2019
   read: IOPS=25.3k, BW=98.7MiB/s (104MB/s)(5924MiB/60005msec)
    slat (usec): min=2, max=9016, avg=37.61, stdev=189.76
    clat (usec): min=1091, max=67156, avg=7874.86, stdev=3184.62
     lat (usec): min=1094, max=67161, avg=7912.54, stdev=3190.38
    clat percentiles (usec):
     |  1.00th=[ 3556],  5.00th=[ 3851], 10.00th=[ 4228], 20.00th=[ 5145],
     | 30.00th=[ 6194], 40.00th=[ 6652], 50.00th=[ 7635], 60.00th=[ 8586],
     | 70.00th=[ 9110], 80.00th=[10159], 90.00th=[11207], 95.00th=[11731],
     | 99.00th=[18482], 99.50th=[23987], 99.90th=[35914], 99.95th=[40109],
     | 99.99th=[49546]
   bw (  KiB/s): min=92949, max=117707, per=12.30%, avg=101417.68, stdev=3178.44, samples=120
   iops        : min=23237, max=29426, avg=25354.18, stdev=794.60, samples=120
  lat (msec)   : 2=0.03%, 4=8.03%, 10=69.19%, 20=21.92%, 50=0.83%
  lat (msec)   : 100=0.01%
  cpu          : usr=3.82%, sys=12.27%, ctx=50055, majf=0, minf=478
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=1516543,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=200
job5: (groupid=0, jobs=1): err= 0: pid=74261: Thu Feb  7 08:06:37 2019
   read: IOPS=25.9k, BW=101MiB/s (106MB/s)(6066MiB/60006msec)
    slat (usec): min=2, max=4416, avg=36.68, stdev=183.59
    clat (usec): min=795, max=69892, avg=7690.25, stdev=3076.28
     lat (usec): min=799, max=69896, avg=7727.00, stdev=3081.83
    clat percentiles (usec):
     |  1.00th=[ 3523],  5.00th=[ 3752], 10.00th=[ 4047], 20.00th=[ 5014],
     | 30.00th=[ 6063], 40.00th=[ 6456], 50.00th=[ 7504], 60.00th=[ 8455],
     | 70.00th=[ 8979], 80.00th=[ 9896], 90.00th=[10945], 95.00th=[11469],
     | 99.00th=[17695], 99.50th=[23200], 99.90th=[34341], 99.95th=[38536],
     | 99.99th=[46924]
   bw (  KiB/s): min=99105, max=120312, per=12.60%, avg=103841.72, stdev=3256.74, samples=120
   iops        : min=24776, max=30078, avg=25960.17, stdev=814.15, samples=120
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.03%, 4=9.49%, 10=71.67%, 20=18.05%, 50=0.74%
  lat (msec)   : 100=0.01%
  cpu          : usr=4.19%, sys=12.24%, ctx=50891, majf=0, minf=222
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=1552972,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=200
job6: (groupid=0, jobs=1): err= 0: pid=74262: Thu Feb  7 08:06:37 2019
   read: IOPS=25.9k, BW=101MiB/s (106MB/s)(6061MiB/60006msec)
    slat (usec): min=2, max=9587, avg=36.57, stdev=183.46
    clat (usec): min=1112, max=69833, avg=7697.27, stdev=3237.04
     lat (usec): min=1115, max=69844, avg=7733.92, stdev=3242.64
    clat percentiles (usec):
     |  1.00th=[ 3392],  5.00th=[ 3720], 10.00th=[ 4113], 20.00th=[ 4948],
     | 30.00th=[ 5932], 40.00th=[ 6521], 50.00th=[ 7373], 60.00th=[ 8291],
     | 70.00th=[ 8979], 80.00th=[ 9765], 90.00th=[10945], 95.00th=[11731],
     | 99.00th=[19268], 99.50th=[23725], 99.90th=[34866], 99.95th=[39060],
     | 99.99th=[47973]
   bw (  KiB/s): min=75253, max=128232, per=12.59%, avg=103760.15, stdev=5928.36, samples=120
   iops        : min=18813, max=32058, avg=25939.76, stdev=1482.04, samples=120
  lat (msec)   : 2=0.04%, 4=9.33%, 10=73.28%, 20=16.47%, 50=0.88%
  lat (msec)   : 100=0.01%
  cpu          : usr=4.07%, sys=13.48%, ctx=51046, majf=0, minf=882
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=1551551,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=200
job7: (groupid=0, jobs=1): err= 0: pid=74263: Thu Feb  7 08:06:37 2019
   read: IOPS=25.3k, BW=98.0MiB/s (104MB/s)(5939MiB/60006msec)
    slat (usec): min=2, max=15698, avg=37.51, stdev=191.19
    clat (usec): min=1043, max=67509, avg=7855.46, stdev=3188.45
     lat (usec): min=1045, max=67512, avg=7893.04, stdev=3194.53
    clat percentiles (usec):
     |  1.00th=[ 3556],  5.00th=[ 3818], 10.00th=[ 4228], 20.00th=[ 5145],
     | 30.00th=[ 6194], 40.00th=[ 6652], 50.00th=[ 7635], 60.00th=[ 8586],
     | 70.00th=[ 9110], 80.00th=[10159], 90.00th=[11207], 95.00th=[11731],
     | 99.00th=[19006], 99.50th=[23987], 99.90th=[35390], 99.95th=[40109],
     | 99.99th=[49021]
   bw (  KiB/s): min=95723, max=124721, per=12.33%, avg=101653.10, stdev=3956.80, samples=120
   iops        : min=23930, max=31180, avg=25413.02, stdev=989.23, samples=120
  lat (msec)   : 2=0.03%, 4=8.17%, 10=69.44%, 20=21.49%, 50=0.86%
  lat (msec)   : 100=0.01%
  cpu          : usr=3.80%, sys=12.39%, ctx=49922, majf=0, minf=222
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=1520295,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=200
job8: (groupid=0, jobs=1): err= 0: pid=74264: Thu Feb  7 08:06:37 2019
   read: IOPS=25.9k, BW=101MiB/s (106MB/s)(6081MiB/60006msec)
    slat (usec): min=2, max=13096, avg=36.61, stdev=184.97
    clat (usec): min=969, max=73831, avg=7671.73, stdev=3483.67
     lat (usec): min=972, max=73843, avg=7708.41, stdev=3489.05
    clat percentiles (usec):
     |  1.00th=[ 3261],  5.00th=[ 3621], 10.00th=[ 3884], 20.00th=[ 4883],
     | 30.00th=[ 5866], 40.00th=[ 6325], 50.00th=[ 7242], 60.00th=[ 8225],
     | 70.00th=[ 8848], 80.00th=[ 9765], 90.00th=[10814], 95.00th=[12125],
     | 99.00th=[21365], 99.50th=[24773], 99.90th=[34866], 99.95th=[39584],
     | 99.99th=[48497]
   bw (  KiB/s): min=92232, max=125250, per=12.63%, avg=104113.25, stdev=5732.34, samples=120
   iops        : min=23058, max=31312, avg=26028.10, stdev=1433.06, samples=120
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.02%, 4=11.16%, 10=72.31%, 20=15.22%, 50=1.27%
  lat (msec)   : 100=0.01%
  cpu          : usr=3.91%, sys=12.59%, ctx=50732, majf=0, minf=460
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=1556718,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=200

Run status group 0 (all jobs):
   READ: bw=805MiB/s (844MB/s), 98.7MiB/s-101MiB/s (104MB/s-106MB/s), io=47.2GiB (50.6GB), run=60005-60006msec

Disk stats (read/write):
  sdj: ios=1534195/2, merge=20605/0, ticks=8438534/5, in_queue=8441088, util=99.90%
  sdk: ios=1532767/2, merge=19716/0, ticks=8430521/10, in_queue=8432107, util=99.91%
  sdl: ios=1535927/2, merge=20544/0, ticks=8442083/5, in_queue=8444273, util=99.96%
  sdm: ios=1498180/2, merge=17516/0, ticks=8415840/5, in_queue=8419245, util=99.97%
  sdn: ios=1531786/2, merge=20241/0, ticks=8460007/5, in_queue=8461721, util=100.00%
  sdo: ios=1530677/2, merge=19887/0, ticks=8438997/4, in_queue=8441186, util=100.00%
  sdp: ios=1501613/2, merge=17726/0, ticks=8415854/5, in_queue=8417555, util=100.00%
  sdq: ios=1535435/2, merge=20285/0, ticks=8440130/5, in_queue=8441575, util=100.00%